SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2c.c
    return HAL_ERR_NONE;
}

/*!
    \brief      I2C error interrupt handler
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2c_error_irq(hal_i2c_dev_struct *i2c)
{
    /* no acknowledge received */
    if(i2c_interrupt_flag_get(i2c->periph, I2C_INT_FLAG_AERR)){
        i2c_interrupt_flag_clear(i2c->periph, I2C_INT_FLAG_AERR);
        i2c->error_state |= HAL_I2C_ERROR_AERR;
        i2c->last_error = HAL_I2C_ERROR_AERR;
    }

    /* over-run or under-run when SCL stretch is disabled */
    if(i2c_interrupt_flag_get(i2c->periph, I2C_INT_FLAG_OUERR)){
        i2c_interrupt_flag_clear(i2c->periph, I2C_INT_FLAG_OUERR);
        i2c->error_state |= HAL_I2C_ERROR_OUERR;
        i2c->last_error = HAL_I2C_ERROR_OUERR;
    }

    /* arbitration lost */
    if(i2c_interrupt_flag_get(i2c->periph, I2C_INT_FLAG_LOSTARB)){
        i2c_interrupt_flag_clear(i2c->periph, I2C_INT_FLAG_LOSTARB);
        i2c->error_state |= HAL_I2C_ERROR_LOSTARB;
        i2c->last_error = HAL_I2C_ERROR_LOSTARB;
    }

    /* bus error */
    if(i2c_interrupt_flag_get(i2c->periph, I2C_INT_FLAG_BERR)){
        i2c_interrupt_flag_clear(i2c->periph, I2C_INT_FLAG_BERR);
        i2c->error_state |= HAL_I2C_ERROR_BERR;
        i2c->last_error = HAL_I2C_ERROR_BERR;
    }

    /* CRC value doesn't match */
    if(i2c_interrupt_flag_get(i2c->periph, I2C_INT_FLAG_PECERR)){
        i2c_interrupt_flag_clear(i2c->periph, I2C_INT_FLAG_PECERR);
        i2c->error_state |= HAL_I2C_ERROR_PECERR;
        i2c->last_error = HAL_I2C_ERROR_PECERR;
    }
    
    if(HAL_I2C_ERROR_NONE != i2c->error_state){
        if(i2c->i2c_irq.error_handle != NULL){
            i2c->i2c_irq.error_handle(i2c);
            i2c->error_state = HAL_I2C_ERROR_NONE;
        }
    }
}

/*!
    \brief      I2C evevt interrupt handler
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2c_event_irq(hal_i2c_dev_struct *i2c)
{
    if(i2c->i2c_irq.event_handle != NULL){
        i2c->i2c_irq.event_handle(i2c);
        return;
    }
    
    /* rxframe rise interrupt handle */
    if(RESET != i2c_interrupt_flag_get(i2c->periph, I2C_INT_FLAG_RFR)){
        i2c_interrupt_flag_clear(i2c->periph, I2C_INT_FLAG_RFR);
        if(NULL != i2c->i2c_irq.rxframe_rise_handle){
            i2c->i2c_irq.rxframe_rise_handle(i2c);
        }
        return;
    }
    /* rxframe fall interrupt handle */
    if(RESET != i2c_interrupt_flag_get(i2c->periph, I2C_INT_FLAG_RFF)){
        i2c_interrupt_flag_clear(i2c->periph, I2C_INT_FLAG_RFF);
        if(NULL != i2c->i2c_irq.rxframe_fall_handle){
            i2c->i2c_irq.rxframe_fall_handle(i2c);
        }
        return;
    }
    /* txframe rise interrupt handle */
    if(RESET != i2c_interrupt_flag_get(i2c->periph, I2C_INT_FLAG_TFR)){
        i2c_interrupt_flag_clear(i2c->periph, I2C_INT_FLAG_TFR);
        if(NULL != i2c->i2c_irq.txframe_rise_handle){
            i2c->i2c_irq.txframe_rise_handle(i2c);
        }
        return;
    }
    /* txframe fall interrupt handle */
    if(RESET != i2c_interrupt_flag_get(i2c->periph, I2C_INT_FLAG_TFF)){
        i2c_interrupt_flag_clear(i2c->periph, I2C_INT_FLAG_TFF);
        if(NULL != i2c->i2c_irq.txframe_fall_handle){
            i2c->i2c_irq.txframe_fall_handle(i2c);
        }
        return;
    }
}

/*!
    \brief      start I2C module function
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     
*/
void hal_i2c_start(hal_i2c_dev_struct *i2c)
{
    i2c_enable(i2c->periph);
}

/*!
    \brief      stop I2C module function
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     
*/
void hal_i2c_stop(hal_i2c_dev_struct *i2c)
{
    i2c_disable(i2c->periph);
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: the structure that contains callback handlers of I2C interrupt
                The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
      \arg        HAL_INTERRUPT_ENABLE_ONLY: The corresponding callback mechanism is out of use, 
                    while enable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_i2c_irq_handle_set(hal_i2c_dev_struct *i2c, hal_i2c_irq_struct *p_irq)
{
    /* event interrupt handler set */
    if(NULL != p_irq->event_handle){
        i2c->i2c_irq.event_handle = p_irq->event_handle;
        i2c_interrupt_enable(i2c->periph, I2C_INT_BUF);
        i2c_interrupt_enable(i2c->periph, I2C_INT_EV);
    }else{
        i2c->i2c_irq.event_handle = NULL;
        i2c_interrupt_disable(i2c->periph, I2C_INT_BUF);
        i2c_interrupt_disable(i2c->periph, I2C_INT_EV);
    }
    /* error interrupt handler set */
    if(NULL != p_irq->error_handle){
        i2c->i2c_irq.error_handle = p_irq->error_handle;
        i2c_interrupt_enable(i2c->periph, I2C_INT_ERR);
    }else{
        i2c->i2c_irq.error_handle = NULL;
        i2c_interrupt_disable(i2c->periph, I2C_INT_ERR);
    }
    /* RFR interrupt handler set */
    if(NULL != p_irq->rxframe_rise_handle){
        i2c->i2c_irq.rxframe_rise_handle = p_irq->rxframe_rise_handle;
        i2c_interrupt_enable(i2c->periph, I2C_INT_RFR);
    }else{
        i2c->i2c_irq.rxframe_rise_handle = NULL;
        i2c_interrupt_disable(i2c->periph, I2C_INT_RFR);
    }
    /* RFF interrupt handler set */
    if(NULL != p_irq->rxframe_fall_handle){
        i2c->i2c_irq.rxframe_fall_handle = p_irq->rxframe_fall_handle;
        i2c_interrupt_enable(i2c->periph, I2C_INT_RFF);
    }else{
        i2c->i2c_irq.rxframe_fall_handle = NULL;
        i2c_interrupt_disable(i2c->periph, I2C_INT_RFF);
    }
    /* TFR interrupt handler set */
    if(NULL != p_irq->txframe_rise_handle){
        i2c->i2c_irq.txframe_rise_handle = p_irq->txframe_rise_handle;
        i2c_interrupt_enable(i2c->periph, I2C_INT_TFR);
    }else{
        i2c->i2c_irq.txframe_rise_handle = NULL;
        i2c_interrupt_disable(i2c->periph, I2C_INT_TFR);
    }
    /* TFF interrupt handler set */
    if(NULL != p_irq->txframe_fall_handle){
        i2c->i2c_irq.txframe_fall_handle = p_irq->txframe_fall_handle;
        i2c_interrupt_enable(i2c->periph, I2C_INT_TFF);
    }else{
        i2c->i2c_irq.txframe_fall_handle = NULL;
        i2c_interrupt_disable(i2c->periph, I2C_INT_TFF);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2c_irq_handle_all_reset(hal_i2c_dev_struct *i2c)
{
    /* configure interrupt callback function to NULL */
    i2c->i2c_irq.event_handle = NULL;
    i2c->i2c_irq.error_handle = NULL;
    i2c->i2c_irq.rxframe_rise_handle = NULL;
    i2c->i2c_irq.rxframe_fall_handle = NULL;
    i2c->i2c_irq.txframe_rise_handle = NULL;
    i2c->i2c_irq.txframe_fall_handle = NULL;
}

/*!
    \brief      transmit amounts of data in master mode, poll transmit process and completed status,
                the function is blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_master_transmit_poll(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                                uint32_t length, uint32_t timeout_ms)
{
    uint32_t data_length;
    
