SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2c.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state whether it is busy or not */
    if(I2C_STATE_BUSY == i2c->tx_state){
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* initialize transmit parameters */
    i2c->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c->txbuffer.length = length;
    i2c->txbuffer.pos = 0;
    data_length = i2c->txbuffer.length;
      
    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    
    i2c->tx_state = I2C_STATE_BUSY;
    i2c->error_state = HAL_I2C_ERROR_NONE;
    /* master sends device address for write request */
    if(HAL_ERR_NONE != _i2c_master_write(i2c, timeout_ms)){
        return HAL_ERR_TIMEOUT;
    }
    /* clear ADDSEND bit */
    i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
    while(i2c->txbuffer.pos < data_length){
        /* wait until the transmission data register is empty */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_TBE, SET, timeout_ms)){
            HAL_DEBUGW("i2c get TBE timeout");
            return HAL_ERR_TIMEOUT;
        }
        i2c_data_transmit(i2c->periph, *i2c->txbuffer.buffer);
        i2c->txbuffer.buffer++;
        i2c->txbuffer.pos++;
    }
    /* send a stop condition to I2C bus */
    i2c_stop_on_bus(i2c->periph);
    while(I2C_CTL0(i2c->periph)&0x0200);
    i2c->tx_state = I2C_STATE_READY;
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data in master mode, poll receive process and completed 
                status, the function is blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be read 
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_master_receive_poll(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                                    uint32_t length, uint32_t timeout_ms)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state whether it is busy or not */
    if(I2C_STATE_BUSY == i2c->rx_state){
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* initialize receive parameters */
    i2c->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c->rxbuffer.length = length;
    i2c->rxbuffer.pos = 0;
    
    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }

    i2c->rx_state = I2C_STATE_BUSY;
    i2c->last_error = HAL_I2C_ERROR_NONE;
    /* master sends device address for read request */
    if(HAL_ERR_NONE != _i2c_master_read(i2c, timeout_ms)){
        return HAL_ERR_TIMEOUT;
    }
    if(1 == i2c->rxbuffer.length){
        /* disable acknowledge */
        i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
        /* clear ADDSEND bit */
        i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
        /* send a stop condition to I2C bus*/
        i2c_stop_on_bus(i2c->periph);
    }else if(2 == i2c->rxbuffer.length){
        /* send a NACK for the next data byte which will be received into the shift register */
        i2c_ackpos_config(i2c->periph, I2C_ACKPOS_NEXT);
        /* disable acknowledge */
        i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
        /* clear ADDSEND bit */
        i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
    }else{
        /* enable acknowledge */
        i2c_ack_config(i2c->periph, I2C_ACK_ENABLE);
        /* clear ADDSEND bit */
        i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
    }
    while(i2c->rxbuffer.length>0){
        if(i2c->rxbuffer.length <= 3){
            if(1 == i2c->rxbuffer.length){
                /* wait until the RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_RBNE, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }

                *i2c->rxbuffer.buffer = i2c_data_receive(i2c->periph);
                i2c->rxbuffer.buffer++;
                i2c->rxbuffer.length--;
            }else if(2 == i2c->rxbuffer.length){
                i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
                /* wait until the BTC bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_BTC, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get BTC timeout");
                    return HAL_ERR_TIMEOUT;
                }
                /* wait until the RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_RBNE, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }
                
                *i2c->rxbuffer.buffer = i2c_data_receive(i2c->periph);
                i2c->rxbuffer.buffer++;
                i2c->rxbuffer.length--;
                /* wait until the RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_RBNE, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }

