SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2c.c
                *i2c->rxbuffer.buffer = i2c_data_receive(i2c->periph);
                i2c->rxbuffer.buffer++;
                i2c->rxbuffer.length--;
                i2c_stop_on_bus(i2c->periph);
            }else{
                /* wait until the BTC bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_BTC, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get BTC timeout");
                    return HAL_ERR_TIMEOUT;
                }

                i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
                *i2c->rxbuffer.buffer = i2c_data_receive(i2c->periph);
                i2c->rxbuffer.buffer++;
                i2c->rxbuffer.length--;
                /* wait until the RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_RBNE, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }

                *i2c->rxbuffer.buffer = i2c_data_receive(i2c->periph);
                i2c->rxbuffer.buffer++;
                i2c->rxbuffer.length--;
                /* wait until the RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_RBNE, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }

                *i2c->rxbuffer.buffer = i2c_data_receive(i2c->periph);
                i2c->rxbuffer.buffer++;
                i2c->rxbuffer.length--;
                /* send a stop condition to I2C bus */
                i2c_stop_on_bus(i2c->periph);
            }
        }else{
            /* wait until the RBNE bit is set */
            if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_RBNE, SET, timeout_ms)){
                HAL_DEBUGW("i2c get RBNE timeout");
                return HAL_ERR_TIMEOUT;
            }
            *i2c->rxbuffer.buffer = i2c_data_receive(i2c->periph);
            i2c->rxbuffer.buffer++;
            i2c->rxbuffer.length--;
        }
    }
    i2c->rx_state = I2C_STATE_READY;
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data in slave mode, poll transmit process and completed status,
                the function is blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_slave_transmit_poll(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                                    uint32_t length, uint32_t timeout_ms)
{
    uint32_t address_format;
    uint32_t data_length;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state whether it is busy or not */
    if(I2C_STATE_BUSY == i2c->tx_state){
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* check the address format */
    if(I2C_SADDR0(i2c->periph)&I2C_SADDR0_ADDFORMAT){
        address_format = I2C_ADDFORMAT_10BITS;
    }else{
        address_format = I2C_ADDFORMAT_7BITS;
    }
    /* initialize transmit parameters */
    i2c->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c->txbuffer.length = length;
    i2c->txbuffer.pos = 0;
    data_length = i2c->txbuffer.length;
    
    i2c->tx_state = I2C_STATE_BUSY;
    i2c->last_error = HAL_I2C_ERROR_NONE;
    i2c_ack_config(i2c->periph, I2C_ACK_ENABLE);
    /* wait until ADDSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)){
        HAL_DEBUGW("i2c get ADDSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* clear ADDSEND bit */
    i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
    if(I2C_ADDFORMAT_10BITS == address_format){
        /* wait until ADDSEND bit is set */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)){
            HAL_DEBUGW("i2c get ADDSEND timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* clear ADDSEND bit */
        i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
    }
    while(data_length > i2c->txbuffer.pos){
        /* wait until the TBE bit is set */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_TBE, SET, timeout_ms)){
            HAL_DEBUGW("i2c get TBE timeout");
            return HAL_ERR_TIMEOUT;
        }
        i2c_data_transmit(i2c->periph, *i2c->txbuffer.buffer);
        i2c->txbuffer.buffer++;
        i2c->txbuffer.pos++;
    }
    /* the master doesn't acknowledge for the last byte */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_AERR, SET, timeout_ms)){
        HAL_DEBUGW("i2c get AERR timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* clear the bit of AERR */
    i2c_flag_clear(i2c->periph, I2C_FLAG_AERR);
    /* disable acknowledge */
    i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
    i2c->tx_state = I2C_STATE_READY;
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data in slave mode, poll receive process and completed 
                status, the function is blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be read 
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_slave_receive_poll(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                               uint32_t length, uint32_t timeout_ms)
{
    uint32_t data_length;
    
