SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2c.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state whether it is busy or not */
    if(I2C_STATE_BUSY == i2c->rx_state){
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize receive parameters */
    i2c->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c->rxbuffer.length = length;
    i2c->rxbuffer.pos = 0;
    data_length = i2c->rxbuffer.length;
    
    i2c->rx_state = I2C_STATE_BUSY;
    i2c->last_error = HAL_I2C_ERROR_NONE;
    i2c_ack_config(i2c->periph, I2C_ACK_ENABLE);
    /* wait until ADDSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)){
        HAL_DEBUGW("i2c get ADDSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* clear ADDSEND bit */
    i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
    
    while(i2c->rxbuffer.pos < data_length){
        /* wait until the RBNE bit is set */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_RBNE, SET, timeout_ms)){
            HAL_DEBUGW("i2c get RBNE timeout");
            return HAL_ERR_TIMEOUT;
        }
        *i2c->rxbuffer.buffer = i2c_data_receive(i2c->periph);
        i2c->rxbuffer.buffer++;
        i2c->rxbuffer.pos++;
    }
    /* wait until the STPDET bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_STPDET, SET, timeout_ms)){
        HAL_DEBUGW("i2c get stop timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* clear the STPDET bit */
    i2c_enable(i2c->periph);
    i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
    i2c->rx_state = I2C_STATE_READY;
    return HAL_ERR_NONE;
}

/*!
    \brief      write amounts of data to memory, poll transmit process and completed status,
                the function is blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_VAL, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_memory_write_poll(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                              uint32_t length, uint32_t timeout_ms)
{
    uint32_t data_length;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check whether the address size is legal */
    if((I2C_MEMORY_ADDRESS_8BIT != i2c->slave_address.address_size) && \
            (I2C_MEMORY_ADDRESS_16BIT != i2c->slave_address.address_size)){
        HAL_DEBUGE("parameter [address_size] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state whether it is busy or not */
    if(I2C_STATE_MEMORY_BUSY_TX == i2c->tx_state){
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* initialize transmit parameters */
    i2c->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c->txbuffer.length = length;
    i2c->txbuffer.pos = 0;
    data_length = i2c->txbuffer.length;
    
    i2c->tx_state = I2C_STATE_MEMORY_BUSY_TX;
    i2c->last_error = HAL_I2C_ERROR_NONE;
    /* master sends device address for memory write request */
    if(HAL_ERR_NONE != _i2c_memory_write(i2c, timeout_ms)){
        return HAL_ERR_TIMEOUT;
    }
    
    while(i2c->txbuffer.pos < data_length){
        /* wait until the transmission data register is empty */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_TBE, SET, timeout_ms)){
            HAL_DEBUGW("i2c get TBE timeout");
            return HAL_ERR_TIMEOUT;
        }
        i2c_data_transmit(i2c->periph, *i2c->txbuffer.buffer);
        i2c->txbuffer.buffer++;
        i2c->txbuffer.pos++;
        /* wait until BTC bit is set */
        if((SET == i2c_flag_get(i2c->periph, I2C_FLAG_BTC)) && (i2c->txbuffer.pos != data_length)){
            HAL_DEBUGW("i2c get BTC timeout");
            return HAL_ERR_TIMEOUT;
        }
    }
    /* send a stop condition to I2C bus */
    i2c_stop_on_bus(i2c->periph);
    while(I2C_CTL0(i2c->periph)&0x0200);
    i2c->tx_state = I2C_STATE_READY;
    return HAL_ERR_NONE;
}

/*!
    \brief      read amounts of data from memory, poll receive process and completed status,
                the function is blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be read 
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_VAL, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_memory_read_poll(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                              uint32_t length, uint32_t timeout_ms)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
