SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2c.c
    /* check whether the address size is legal */
    if((I2C_MEMORY_ADDRESS_8BIT != i2c->slave_address.address_size) && \
                (I2C_MEMORY_ADDRESS_16BIT != i2c->slave_address.address_size)){
        HAL_DEBUGE("parameter [address_size] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state whether it is busy or not */
    if(I2C_STATE_MEMORY_BUSY_RX == i2c->rx_state){
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    
    i2c->rx_state = I2C_STATE_MEMORY_BUSY_RX;
    i2c->last_error = HAL_I2C_ERROR_NONE;
    if(2 == length){
        /* send a NACK for the next data byte which will be received into the shift register */
        i2c_ackpos_config(i2c->periph, I2C_ACKPOS_NEXT);
    }
    /* master sends device address for memory read request */
    if(HAL_ERR_NONE != _i2c_memory_read(i2c, timeout_ms)){
        return HAL_ERR_TIMEOUT;
    }

    if(1 == length){
        /* disable acknowledge */
        i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
        /* clear ADDSEND bit */
        i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
        /* send a stop condition to I2C bus */
        i2c_stop_on_bus(i2c->periph);
    }else if(2 == length){
        /* disable acknowledge */
        i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
        /* clear ADDSEND bit */
        i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
    }else{
        /* clear ADDSEND bit */
        i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
    }
    while(length > 0){
        if(length <= 3){
            if(1 == length){
                /* wait until RBNE bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_RBNE, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get RBNE timeout");
                    return HAL_ERR_TIMEOUT;
                }
                
                (*p_buffer++) = i2c_data_receive(i2c->periph);
                length--;
            }else if(2 == length){
                i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
                /* wait until BTC bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_BTC, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get BTC timeout");
                    return HAL_ERR_TIMEOUT;
                }
                /* send a stop condition to I2C bus */
                i2c_stop_on_bus(i2c->periph);
                (*p_buffer++) = i2c_data_receive(i2c->periph);
                length--;
                (*p_buffer++) = i2c_data_receive(i2c->periph);
                length--;
            }else{
                /* wait until BTC bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_BTC, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get BTC timeout");
                    return HAL_ERR_TIMEOUT;
                }
                /* disable acknowledge */
                i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
                (*p_buffer++) = i2c_data_receive(i2c->periph);
                length--;
                /* wait until BTC bit is set */
                if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_BTC, SET, timeout_ms)){
                    HAL_DEBUGW("i2c get BTC timeout");
                    return HAL_ERR_TIMEOUT;
                }
                /* send a stop condition to I2C bus */
                i2c_stop_on_bus(i2c->periph);
                (*p_buffer++) = i2c_data_receive(i2c->periph);
                length--;
                (*p_buffer++) = i2c_data_receive(i2c->periph);
                length--;
            }
        }else{
            /* wait until RBNE bit is set */
            if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_RBNE, SET, timeout_ms)){
                HAL_DEBUGW("i2c get RBNE timeout");
                return HAL_ERR_TIMEOUT;
            }
            (*p_buffer++) = i2c_data_receive(i2c->periph);
            length--;
            /* wait until BTC bit is set */
            if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_BTC, SET, timeout_ms)){
                HAL_DEBUGW("i2c get BTC timeout");
                return HAL_ERR_TIMEOUT;
            }
            (*p_buffer++) = i2c_data_receive(i2c->periph);
            length--;
        }
    }
    i2c->rx_state = I2C_STATE_READY;
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data in master mode by interrupt method, the function 
                is non-blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_master_transmit_interrupt(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                                    uint32_t length, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state whether it is busy or not */
    if(I2C_STATE_BUSY == i2c->tx_state){
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* the master waits until the I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)){
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* initialize transmit parameters */
    i2c->tx_state = I2C_STATE_BUSY;
    i2c->error_state = HAL_I2C_ERROR_NONE;
    i2c->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c->txbuffer.length = length;
    i2c->txbuffer.pos = 0;
    i2c->tx_callback = (void *)p_user_func;
    i2c->i2c_irq.event_handle = _i2c_master_transmit_interrupt;
    
    /* the master sends a start condition to I2C bus */
    i2c_start_on_bus(i2c->periph);    
    /* enable the I2C interrupt */
    i2c_interrupt_enable(i2c->periph, I2C_INT_ERR);
    i2c_interrupt_enable(i2c->periph, I2C_INT_BUF);
    i2c_interrupt_enable(i2c->periph, I2C_INT_EV);

