SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2c.c
    /* check whether the address size is legal */
    if((I2C_MEMORY_ADDRESS_8BIT != i2c->slave_address.address_size) && \
                (I2C_MEMORY_ADDRESS_16BIT != i2c->slave_address.address_size)){
        HAL_DEBUGE("parameter [address_size] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state whether it is busy or not */
    if(I2C_STATE_MEMORY_BUSY_TX == i2c->tx_state){
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    /* initialize transmit parameters */
    i2c->tx_state = I2C_STATE_MEMORY_BUSY_TX;
    i2c->last_error = HAL_I2C_ERROR_NONE;
    i2c->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c->txbuffer.length = length;
    i2c->txbuffer.pos = 0;
    i2c->tx_callback = (void *)p_user_func;
    i2c->i2c_irq.event_handle = _i2c_memmory_write_interrupt;

    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2c->periph);
    /* enable I2C interrupt */
    i2c_interrupt_enable(i2c->periph, I2C_INT_ERR);
    i2c_interrupt_enable(i2c->periph, I2C_INT_BUF);
    i2c_interrupt_enable(i2c->periph, I2C_INT_EV);
    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)){
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      read amounts of data from memory by interrupt method, the function is non-blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be read
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_memory_read_interrupt(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                              uint32_t length, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check i2c pointer, p_buffer address and length */
    if((NULL == i2c) || (NULL == p_buffer) || (0 == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check whether the address size is legal */
    if((I2C_MEMORY_ADDRESS_8BIT != i2c->slave_address.address_size) && \
                (I2C_MEMORY_ADDRESS_16BIT != i2c->slave_address.address_size)){
        HAL_DEBUGE("parameter [address_size] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state whether it is busy or not */
    if(I2C_STATE_MEMORY_BUSY_RX == i2c->rx_state){
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize transmit parameters */
    i2c->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c->rxbuffer.length = length;
    i2c->rxbuffer.pos = 0;
    i2c->rx_state = I2C_STATE_MEMORY_BUSY_RX;
    i2c->last_error = HAL_I2C_ERROR_NONE;
    i2c->rx_callback = (void *)p_user_func;
    i2c->i2c_irq.event_handle = _i2c_memory_read_interrupt;
    if(2 == i2c->rxbuffer.length){
        i2c_ackpos_config(i2c->periph, I2C_ACKPOS_NEXT);
    }    

    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2c->periph);
    /* enable I2C interrupt */
    i2c_interrupt_enable(i2c->periph, I2C_INT_ERR);
    i2c_interrupt_enable(i2c->periph, I2C_INT_BUF);
    i2c_interrupt_enable(i2c->periph, I2C_INT_EV);
    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)){
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data in master mode by dma method, the function 
                is non-blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_master_transmit_dma(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                               uint32_t length, hal_i2c_user_cb p_user_func)
{
    hal_dma_irq_struct dma_irq;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check i2c pointer, p_buffer address and length */
    if((NULL == i2c) || (NULL == p_buffer) || (0 == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check whether the pointer of DMA tx is NULL */
    if(NULL == i2c->p_dma_tx){
        HAL_DEBUGE("parameter [i2c->p_dma_tx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check whether the tx state is ready */
    if(I2C_STATE_BUSY == i2c->tx_state){
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)){
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    /* initialize transmit parameters */
    i2c->tx_state = I2C_STATE_BUSY;
    i2c->error_state = HAL_I2C_ERROR_NONE;
    i2c->txbuffer.buffer = (uint8_t *)p_buffer; 
    i2c->txbuffer.length = length;
    i2c->txbuffer.pos = 0;
    i2c->tx_callback = (void *)p_user_func;
    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _i2c_transmit_dma;
    dma_irq.error_handle = _i2c_dma_error; 
    if(NULL != i2c->p_dma_tx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = i2c->p_dma_tx->dma_irq.half_finish_handle;
    }
    /* master sends device address for write request */
    if(HAL_ERR_NONE != _i2c_master_write(i2c, I2C_TIMEOUT)){
        return HAL_ERR_TIMEOUT;
    }
    /* clear ADDSEND bit */
    i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
    /* enable I2C DMA */
    i2c_dma_enable(i2c->periph, I2C_DMA_ON);
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(i2c->p_dma_tx, (uint32_t)i2c->txbuffer.buffer, \
                           (uint32_t)&I2C_DATA(i2c->periph), length, &dma_irq);
    /* clear DMA global interrupt flag */
    dma_flag_clear(i2c->p_dma_tx->channel, DMA_FLAG_G);

