SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2c.c
    return HAL_ERR_NONE;
}

/*!
    \brief      read amounts of data from memory by dma method, the function is non-blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be read 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_memory_read_dma(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                              uint32_t length, hal_i2c_user_cb p_user_func)
{
    hal_dma_irq_struct dma_irq;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check i2c pointer, p_buffer address and length */
    if((NULL == i2c) || (NULL == p_buffer) || (0 == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    /* check whether the address size is legal */
    if((I2C_MEMORY_ADDRESS_8BIT != i2c->slave_address.address_size) && \
                    (I2C_MEMORY_ADDRESS_16BIT != i2c->slave_address.address_size)){
        HAL_DEBUGE("parameter [address_size] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* wait until I2C bus is idle */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)){
        HAL_DEBUGW("i2c busy timeout");
        return HAL_ERR_TIMEOUT;
    }
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    /* initialize receive parameters */
    i2c->rx_state = I2C_STATE_MEMORY_BUSY_RX;
    i2c->last_error = HAL_I2C_ERROR_NONE;
    i2c->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c->rxbuffer.length = length;
    i2c->rxbuffer.pos = 0;
    i2c->rx_callback = (void *)p_user_func;
    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _i2c_transmit_dma;
    dma_irq.error_handle = _i2c_dma_error; 
    if(NULL != i2c->p_dma_rx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = i2c->p_dma_rx->dma_irq.half_finish_handle;
    }

    /* master sends device address for memory read request */
    if(HAL_ERR_NONE != _i2c_memory_read(i2c, I2C_TIMEOUT)){
        return HAL_ERR_TIMEOUT;
    }
    if(2 == length){
        /* send a NACK for the next data byte which will be received into the shift register */
        i2c_ackpos_config(i2c->periph, I2C_ACKPOS_NEXT);
    }
    if(1 == length){
        /* disable acknowledge */
        i2c_ack_config(i2c->periph, I2C_ACK_DISABLE);
    }else{
        /* configure the next DMA EOT as the DMA last transfer */
        i2c_dma_last_transfer_config(i2c->periph, I2C_DMALST_ON);
    }
    /* clear ADDSEND bit */
    i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
    /* enable I2C DMA */
    i2c_dma_enable(i2c->periph, I2C_DMA_ON);
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(i2c->p_dma_rx, (uint32_t)&I2C_DATA(i2c->periph), \
                            (uint32_t)i2c->rxbuffer.buffer, length, &dma_irq);
    /* clear DMA global interrupt flag */
    dma_flag_clear(i2c->p_dma_rx->channel, DMA_FLAG_G);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      check whether the device is ready for access
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_NONE, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_device_ready_check(hal_i2c_dev_struct *i2c, uint32_t timeout_ms)
{
    __IO uint32_t val = 0;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check i2c pointer */
    if((NULL == i2c)){
        HAL_DEBUGE("parameter [i2c] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    while(1){
        while(i2c_flag_get(i2c->periph, I2C_FLAG_I2CBSY));
        /* wait until I2C bus is idle */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* check if I2C is already enabled */
        if(I2C_CTL0_I2CEN != (I2C_CTL0(i2c->periph) & I2C_CTL0_I2CEN)){
            i2c_enable(i2c->periph);
        }
        
        /* send a start condition to I2C bus */
        i2c_start_on_bus(i2c->periph);
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_SBSEND, SET, timeout_ms)){
            HAL_DEBUGW("i2c get SBSEND timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* wait until SBSEND bit is set */
        while(!i2c_flag_get(i2c->periph, I2C_FLAG_SBSEND));
        /* send slave address to I2C bus */
        i2c_master_addressing(i2c->periph, i2c->slave_address.device_address, I2C_TRANSMITTER);
        
        do{
            val = I2C_STAT0(i2c->periph);
        }while(0 == (val & (I2C_STAT0_ADDSEND | I2C_STAT0_AERR)));
        
        if(val & I2C_STAT0_ADDSEND){

            /* clear ADDSEND bit */
            i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
            /* send a stop condition to I2C bus */
            i2c_stop_on_bus(i2c->periph);
            /* wait until I2C bus is idle */
            if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
                HAL_DEBUGW("i2c busy timeout");
                return HAL_ERR_TIMEOUT;
            }
            return HAL_ERR_NONE;
        }else{
            /* clear AERR bit */
            i2c_flag_clear(i2c->periph, I2C_FLAG_AERR);
            /* send a stop condition to I2C bus */
            i2c_stop_on_bus(i2c->periph);
            while(I2C_CTL0(i2c->periph)&0x0200);
            
            /* wait until I2C bus is idle */
            if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, timeout_ms)){
                HAL_DEBUGW("i2c busy timeout");
                return HAL_ERR_TIMEOUT;
            }
        }
    }
}

/*!
    \brief      serial transmit amounts of data in master mode by interrupt method, the function 
                is non-blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_master_serial_transmit_interrupt(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                                    uint32_t length, hal_i2c_user_cb p_user_func)
{
    __IO uint32_t previous_state = HAL_I2C_PREVIOUS_STATE_NONE;
    
