SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2c.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state whether it is busy or not */
    if(I2C_STATE_BUSY == i2c->tx_state){
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    if((I2C_FIRST_TRANSFER == i2c->transfer_option) || \
        (I2C_NO_OPTION_TRANSFER == i2c->transfer_option)){
        /* the master waits until the I2C bus is idle */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)){
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
    }
    /* check if I2C is already enabled */
    if(I2C_CTL0_I2CEN != (I2C_CTL0(i2c->periph) & I2C_CTL0_I2CEN)){
        i2c_enable(i2c->periph);
    }
    /* initialize transmit parameters */
    i2c->tx_state = I2C_STATE_BUSY;
    i2c->error_state = HAL_I2C_ERROR_NONE;
    previous_state = i2c->previous_state;
    i2c->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c->txbuffer.length = length;
    i2c->txbuffer.pos = 0;
    i2c->tx_callback = (void *)p_user_func;
    i2c->i2c_irq.event_handle = _i2c_master_transmit_interrupt;
    
    /* the master sends a start condition to I2C bus */
    i2c_start_on_bus(i2c->periph);

    /* enable the I2C interrupt */
    i2c_interrupt_enable(i2c->periph, I2C_INT_ERR);
    i2c_interrupt_enable(i2c->periph, I2C_INT_BUF);
    i2c_interrupt_enable(i2c->periph, I2C_INT_EV);

    return HAL_ERR_NONE;
}

/*!
    \brief      serial receive amounts of data in master mode by interrupt method, the function 
                is non-blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be receive 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_BUSY, 
                details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_master_serial_receive_interrupt(hal_i2c_dev_struct *i2c, uint8_t *p_buffer, \
                                    uint32_t length, hal_i2c_user_cb p_user_func)
{
    __IO uint32_t previous_state = HAL_I2C_PREVIOUS_STATE_NONE;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state whether it is busy or not */
    if(I2C_STATE_BUSY == i2c->rx_state){
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    if(I2C_FIRST_TRANSFER == i2c->transfer_option){
        /* wait until I2C bus is idle */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_I2CBSY, RESET, I2C_BUSY_TIMEOUT)){
            HAL_DEBUGW("i2c busy timeout");
            return HAL_ERR_TIMEOUT;
        }
    }
    /* check if I2C is already enabled */
    if(I2C_CTL0_I2CEN != (I2C_CTL0(i2c->periph) & I2C_CTL0_I2CEN)){
        i2c_enable(i2c->periph);
    }
    /* initialize receive parameters */
    i2c->rx_state = I2C_STATE_BUSY;
    i2c->last_error = HAL_I2C_ERROR_NONE;
    previous_state = i2c->previous_state;
    i2c->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c->rxbuffer.length = length;
    i2c->rxbuffer.pos = 0;
    i2c->rx_callback = (void *)p_user_func;
    i2c->i2c_irq.event_handle = _i2c_master_receive_interrupt;
    if(2 == i2c->rxbuffer.length){
        /* send a NACK for the next data byte which will be received into the shift register */
        i2c_ackpos_config(i2c->periph, I2C_ACKPOS_NEXT);
    }
    
    /* the master sends a start condition to I2C bus */
    i2c_start_on_bus(i2c->periph);

    /* enable the I2C interrupt */
    i2c_interrupt_enable(i2c->periph, I2C_INT_ERR);
    i2c_interrupt_enable(i2c->periph, I2C_INT_EV);
    i2c_interrupt_enable(i2c->periph, I2C_INT_BUF);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      serial transmit amounts of data in slave mode by interrupt method, the function is 
                non-blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_slave_serial_transmit_interrupt(hal_i2c_dev_struct *i2c, uint8_t *p_buffer,\
                                    uint32_t length, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state whether it is in address listen mode */
    if(I2C_STATE_LISTEN != i2c->tx_state){
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    /* check if I2C is already enabled */
    if(I2C_CTL0_I2CEN != (I2C_CTL0(i2c->periph) & I2C_CTL0_I2CEN)){
        i2c_enable(i2c->periph);
    }
    /* initialize transmit parameters */
    i2c->tx_state = I2C_STATE_BUSY_LISTEN;
    i2c->error_state = HAL_I2C_ERROR_NONE;
    i2c->txbuffer.buffer = (uint8_t *)p_buffer;
    i2c->txbuffer.length = length;
    i2c->txbuffer.pos = 0;
    i2c->tx_callback = (void *)p_user_func;
    i2c->i2c_irq.event_handle = _i2c_slave_transmit_interrupt;

    /* enable I2C interrupt */
    i2c_interrupt_enable(i2c->periph, I2C_INT_ERR);
    i2c_interrupt_enable(i2c->periph, I2C_INT_BUF);
    i2c_interrupt_enable(i2c->periph, I2C_INT_EV);
    return HAL_ERR_NONE;
}

/*!
    \brief      serial receive amounts of data in slave mode by interrupt method, the function 
                is non-blocking
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be receive 
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_BUSY, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_slave_serial_receive_interrupt(hal_i2c_dev_struct *i2c, uint8_t *p_buffer,\
                                    uint32_t length, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == i2c) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [i2c] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state whether it is in address listen mode */
    if(I2C_STATE_LISTEN != i2c->rx_state){
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    /* check if I2C is already enabled */
    if(I2C_CTL0_I2CEN != (I2C_CTL0(i2c->periph) & I2C_CTL0_I2CEN)){
        i2c_enable(i2c->periph);
    }
    /* initialize transmit parameters */
    i2c->rx_state = I2C_STATE_BUSY_LISTEN;
    i2c->last_error = HAL_I2C_ERROR_NONE;
    i2c->rxbuffer.buffer = (uint8_t *)p_buffer;
    i2c->rxbuffer.length = length;
    i2c->rxbuffer.pos = 0;
    i2c->rx_callback = (void *)p_user_func;
    i2c->i2c_irq.event_handle = _i2c_slave_serial_receive_interrupt;

    /* enable I2C interrupt */
    i2c_interrupt_enable(i2c->periph, I2C_INT_ERR);
    i2c_interrupt_enable(i2c->periph, I2C_INT_BUF);
    i2c_interrupt_enable(i2c->periph, I2C_INT_EV);
    return HAL_ERR_NONE;
}

/*!
    \brief      enable address listen in slave mode by interrupt method
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_user_func: call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_BUSY, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_address_listen_interrupt_enable(hal_i2c_dev_struct *i2c, hal_i2c_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == i2c){
        HAL_DEBUGE("parameter [i2c] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the tx_state whether it is busy or not */
    if(I2C_STATE_BUSY == i2c->tx_state){
        HAL_DEBUGE("i2c tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    /* check the rx_state whether it is busy or not */
    if(I2C_STATE_BUSY == i2c->rx_state){
        HAL_DEBUGE("i2c rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    i2c->tx_state = I2C_STATE_LISTEN;
    i2c->rx_state = I2C_STATE_LISTEN;
    /* check if I2C is already enabled */
    if(I2C_CTL0_I2CEN != (I2C_CTL0(i2c->periph) & I2C_CTL0_I2CEN)){
        i2c_enable(i2c->periph);
    }
    /* enable acknowledge */
    i2c_ack_config(i2c->periph, I2C_ACK_ENABLE);
    
    i2c->rx_callback = (void *)p_user_func;
    i2c->i2c_irq.event_handle = _i2c_address_listen_interrupt;
    
    /* enable I2C interrupt */
    i2c_interrupt_enable(i2c->periph, I2C_INT_ERR);
    i2c_interrupt_enable(i2c->periph, I2C_INT_EV);
    return HAL_ERR_NONE;
}

/*!
    \brief      disable address listen in slave mode by interrupt method
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_BUSY, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2c_address_listen_interrupt_disable(hal_i2c_dev_struct *i2c)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == i2c){
        HAL_DEBUGE("parameter [i2c] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    if((I2C_STATE_LISTEN == i2c->tx_state) && (I2C_STATE_LISTEN == i2c->rx_state)){
        i2c->tx_state = I2C_STATE_READY;
        i2c->rx_state = I2C_STATE_READY;
        /* disable acknowledge */
        i2c_ack_config(i2c->periph, I2C_ACK_ENABLE);
        /* disable I2C interrupt */
        i2c_interrupt_disable(i2c->periph, I2C_INT_ERR);
        i2c_interrupt_disable(i2c->periph, I2C_INT_EV);
        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      wait the flag status until timeout
    \param[in]  i2c_periph: I2Cx(x=0,1)
    \param[in]  flag: I2C flags, refer to i2c_flag_enum
    \param[in]  status: the status of I2C flag to wait 
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h 
*/
static int32_t _i2c_wait_flag_timeout(uint32_t i2c_periph, i2c_flag_enum flag, \
                                      FlagStatus status, uint32_t timeout_ms)
{
    uint32_t tick_start;
    /* set timeout */
    tick_start = hal_basetick_count_get();
    /* wait flag status RESET */
    if(RESET == status){
        while(SET == i2c_flag_get(i2c_periph, flag)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("i2c get flag timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    }else{
        /* wait flag status SET */
        while(RESET == i2c_flag_get(i2c_periph, flag)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("i2c get flag timeout");
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      master sends device address for write request
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h 
*/
static int32_t _i2c_master_write(hal_i2c_dev_struct *i2c, uint32_t timeout_ms)
{
    uint16_t first_byte, second_byte;
    uint32_t address_format;
    /* check the address format */
    if(I2C_SADDR0(i2c->periph)&I2C_SADDR0_ADDFORMAT){
        address_format = I2C_ADDFORMAT_10BITS;
    }else{
        address_format = I2C_ADDFORMAT_7BITS;
    }
    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2c->periph);
    /* wait until SBSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_SBSEND, SET, timeout_ms)){
        HAL_DEBUGW("i2c get SBSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    
    /* send slave address to I2C bus */
    if(I2C_ADDFORMAT_7BITS == address_format){
        /* 7-bit addressing */
        i2c_master_addressing(i2c->periph, i2c->slave_address.device_address, I2C_TRANSMITTER);
    }else{
        /* 10-bit addressing */
        first_byte = SLAVE10_FIRST_BYTE(i2c->slave_address.device_address);
        second_byte = SLAVE10_SECOND_BYTE(i2c->slave_address.device_address);
        
