SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2c.c
        i2c_master_addressing(i2c->periph, first_byte, I2C_TRANSMITTER);
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_ADD10SEND, SET, timeout_ms)){
            HAL_DEBUGW("i2c get ADD10SEND timeout");
            return HAL_ERR_TIMEOUT;
        }
        i2c_master_addressing(i2c->periph, second_byte, I2C_TRANSMITTER);
    }
    /* wait until ADDSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)){
        HAL_DEBUGW("i2c get ADDSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      event handler in I2C master transmit mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_master_transmit_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    uint16_t first_byte, second_byte;
    uint32_t address_format;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->tx_callback;
    uint32_t data_length;
    
    data_length = p_i2c->txbuffer.length;
    
    if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_SBSEND)){
        /* check the address format */
        if(I2C_SADDR0(p_i2c->periph)&I2C_SADDR0_ADDFORMAT){
            address_format = I2C_ADDFORMAT_10BITS;
        }else{
            address_format = I2C_ADDFORMAT_7BITS;
        }
        if(I2C_ADDFORMAT_10BITS == address_format){
            first_byte = SLAVE10_FIRST_BYTE(p_i2c->slave_address.device_address);
            /* send slave address first byte to I2C bus */
            i2c_master_addressing(p_i2c->periph, first_byte, I2C_TRANSMITTER);
        }else{
            /* send slave address */
            i2c_master_addressing(p_i2c->periph, p_i2c->slave_address.device_address, I2C_TRANSMITTER);
        }
    }else if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADD10SEND)){
        second_byte = SLAVE10_SECOND_BYTE(p_i2c->slave_address.device_address);
        /* send slave address second byte to I2C bus */
        i2c_master_addressing(p_i2c->periph, second_byte, I2C_TRANSMITTER);
    }else if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADDSEND)){
        /*clear ADDSEND bit */
        i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
    }else if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_TBE)){
        if(data_length > p_i2c->txbuffer.pos){
            /* the master sends a data byte */
            i2c_data_transmit(p_i2c->periph, *p_i2c->txbuffer.buffer++);
            p_i2c->txbuffer.pos++;
        }else{
            if((I2C_NO_OPTION_TRANSFER != p_i2c->transfer_option) && \
                (I2C_LAST_TRANSFER != p_i2c->transfer_option)){
                /* disable the I2C interrupt */
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
                p_i2c->previous_state = HAL_I2C_PREVIOUS_STATE_TX;
            }else{
                /* the master sends a stop condition to I2C bus */
                i2c_stop_on_bus(p_i2c->periph);
                /* disable the I2C interrupt */
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
            }
            if(NULL != p_func){
                p_func(p_i2c);
            }
            p_i2c->tx_state = I2C_STATE_READY;
        }
    }
}

/*!
    \brief      DMA full finish handler in I2C master transmit mode
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     none
*/
static void _i2c_transmit_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_i2c_dev_struct *p_i2c;
    hal_i2c_user_cb p_func;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_i2c = (hal_i2c_dev_struct*)p_dma->p_periph;
    p_func = (hal_i2c_user_cb)p_i2c->tx_callback;
    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)){
        p_i2c->txbuffer.pos = p_i2c->txbuffer.length;
        i2c_dma_enable(p_i2c->periph, I2C_DMA_OFF);
        p_i2c->tx_state = I2C_STATE_READY;
    }
    if(RESET != i2c_flag_get(p_i2c->periph, I2C_FLAG_MASTER)){
        i2c_stop_on_bus(p_i2c->periph);
        while(I2C_CTL0(p_i2c->periph)&0x0200);
    }else{
        if(RESET == i2c_flag_get(p_i2c->periph, I2C_FLAG_TR)){
            while(!i2c_flag_get(p_i2c->periph, I2C_FLAG_STPDET));
            /* clear the STPDET bit */
            i2c_enable(p_i2c->periph);
        }
    }

    if(NULL != p_func){
        p_func(p_i2c);
    }
}

/*!
    \brief      handle the I2C DMA error process
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     none
*/
static void _i2c_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_i2c_dev_struct *p_i2c;
    p_dma = (hal_dma_dev_struct*)dma;
    p_i2c = (hal_i2c_dev_struct*)p_dma->p_periph;

    if(I2C_STATE_BUSY == p_i2c->tx_state){
        /* transmit state is busy */
        p_i2c->error_state |= HAL_I2C_ERROR_DMATX;
        p_i2c->last_error = HAL_I2C_ERROR_DMATX;
        p_i2c->txbuffer.pos = p_i2c->txbuffer.length;
        /* disable DMA transmit and reset tx_state */
        i2c_dma_enable(p_i2c->periph, I2C_DMA_OFF);
        i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
        i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
        i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
        p_i2c->tx_state = I2C_STATE_READY;
    }else if(I2C_STATE_BUSY == p_i2c->rx_state){
        /* receive state is busy */
        p_i2c->error_state |= HAL_I2C_ERROR_DMATX;
        p_i2c->last_error = HAL_I2C_ERROR_DMATX;
        p_i2c->rxbuffer.pos = p_i2c->rxbuffer.length;
        /* disable DMA receive, PERR, ERR interrupt */
        i2c_dma_enable(p_i2c->periph, I2C_DMA_OFF);
        i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
        i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
        i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
        /* reset rx_state */
        p_i2c->rx_state = I2C_STATE_READY;
    }else{
        HAL_DEBUGE("i2c processor fatal error: dma error exception due to run state");
    }

    if(p_i2c->i2c_irq.error_handle != NULL){
        /* if there is a user error callback */
        p_i2c->i2c_irq.error_handle(p_i2c);
        p_i2c->error_state = HAL_I2C_ERROR_NONE;
    }
}

/*!
    \brief      master sends device address for read request
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h 
*/
static int32_t _i2c_master_read(hal_i2c_dev_struct *i2c, uint32_t timeout_ms)
{
    uint16_t first_byte, second_byte;
    uint32_t address_format;
    /* check the address format */
    if(I2C_SADDR0(i2c->periph)&I2C_SADDR0_ADDFORMAT){
        address_format = I2C_ADDFORMAT_10BITS;
    }else{
        address_format = I2C_ADDFORMAT_7BITS;
    }
    
    /* send a start condition to I2C bus */
    i2c_start_on_bus(i2c->periph);
    /* wait until SBSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_SBSEND, SET, timeout_ms)){
        HAL_DEBUGW("i2c get SBSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    
    /* send slave address to I2C bus */
    if(I2C_ADDFORMAT_7BITS == address_format){
        /* 7-bit addressing */
        i2c_master_addressing(i2c->periph, i2c->slave_address.device_address, I2C_RECEIVER);
    }else{
        /* 10-bit addressing */
        first_byte = SLAVE10_FIRST_BYTE(i2c->slave_address.device_address);
        second_byte = SLAVE10_SECOND_BYTE(i2c->slave_address.device_address);
        /* send slave address first byte to I2C bus */
        i2c_master_addressing(i2c->periph, first_byte, I2C_TRANSMITTER);
        /* wait until ADD10SEND bit is set */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_ADD10SEND, SET, timeout_ms)){
            HAL_DEBUGW("i2c get ADD10SEND timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* send slave address 2nd byte to I2C bus */
        i2c_master_addressing(i2c->periph, second_byte, I2C_TRANSMITTER);
        /* wait until ADDSEND bit is set */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)){
            HAL_DEBUGW("i2c get ADDSEND timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* clear ADDSEND bit */
        i2c_flag_clear(i2c->periph, I2C_FLAG_ADDSEND);
        /* send a start condition to I2C bus */
        i2c_start_on_bus(i2c->periph);
        /* wait until SBSEND bit is set */
        if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_SBSEND, SET, timeout_ms)){
            HAL_DEBUGW("i2c get SBSEND timeout");
            return HAL_ERR_TIMEOUT;
        }
        /* send slave address first byte to I2C bus */
        i2c_master_addressing(i2c->periph, first_byte, I2C_RECEIVER);
    }
    /* wait until ADDSEND bit is set */
    if(HAL_ERR_NONE != _i2c_wait_flag_timeout(i2c->periph, I2C_FLAG_ADDSEND, SET, timeout_ms)){
        HAL_DEBUGW("i2c get ADDSEND timeout");
        return HAL_ERR_TIMEOUT;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      event handler in I2C master receive mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_master_receive_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    uint16_t first_byte, second_byte;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->rx_callback;
    uint32_t data_length;
    
