SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2c.c
    data_length = p_i2c->txbuffer.length;

    if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_SBSEND)){
        /* send slave address */
        i2c_master_addressing(p_i2c->periph, p_i2c->slave_address.device_address, I2C_TRANSMITTER);
    }else if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADDSEND)){
        /*clear ADDSEND bit */
        i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
    }else if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_TBE)){
        if(RESET == p_i2c->slave_address.address_complete){
            if(I2C_MEMORY_ADDRESS_8BIT == p_i2c->slave_address.address_size){
                i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_LSB(p_i2c->slave_address.memory_address));
                p_i2c->slave_address.address_complete = SET;
            }else{
                if(0 == p_i2c->slave_address.address_count){
                    i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_MSB(p_i2c->slave_address.memory_address));
                    p_i2c->slave_address.address_count++;
                }else{
                    i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_LSB(p_i2c->slave_address.memory_address));
                }
            }
            p_i2c->slave_address.address_complete = SET;
        }else{
           if(data_length > p_i2c->txbuffer.pos){
                /* the master sends a data byte */
                i2c_data_transmit(p_i2c->periph, *p_i2c->txbuffer.buffer++);
                p_i2c->txbuffer.pos++;
               
            }else{
                /* the master sends a stop condition to I2C bus */
                i2c_stop_on_bus(p_i2c->periph);
                /* disable the I2C interrupt */
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
                if(NULL != p_func){
                    p_func(p_i2c);
                }
                p_i2c->tx_state = I2C_STATE_READY;
            }
        }
    }
}

/*!
    \brief      event handler of memory read in I2C master mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_memory_read_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->rx_callback;
    uint32_t data_length;
    
    data_length = p_i2c->rxbuffer.length;
    
    if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_SBSEND)){
        if(RESET == p_i2c->slave_address.second_addressing){
            i2c_master_addressing(p_i2c->periph, p_i2c->slave_address.device_address, I2C_TRANSMITTER);
            
        }else{
            /* the master sends slave address */
            i2c_master_addressing(p_i2c->periph, p_i2c->slave_address.device_address, I2C_RECEIVER);
        }
    }else if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADDSEND)){
        if(RESET == p_i2c->slave_address.second_addressing){
            /* clear the ADDSEND bit */
            i2c_interrupt_flag_clear(p_i2c->periph,I2C_INT_FLAG_ADDSEND);
        }else{
            if((1 == data_length - p_i2c->rxbuffer.pos)|| \
                (2 == data_length - p_i2c->rxbuffer.pos)){
                /* clear the ACKEN before the ADDSEND is cleared */
                i2c_ack_config(p_i2c->periph, I2C_ACK_DISABLE);
                /* clear the ADDSEND bit */
                i2c_interrupt_flag_clear(p_i2c->periph,I2C_INT_FLAG_ADDSEND);
            }else{
                /* clear the ADDSEND bit */
                i2c_interrupt_flag_clear(p_i2c->periph,I2C_INT_FLAG_ADDSEND);
            }
        }
    }else if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_RBNE)){
        if(data_length > p_i2c->rxbuffer.pos){
            if(3 == data_length - p_i2c->rxbuffer.pos){
                /* wait until the second last data byte is received into the shift register */
                while(!i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_BTC));
                /* send a NACK for the last data byte */
                i2c_ack_config(p_i2c->periph, I2C_ACK_DISABLE);
            }
            /* read a data byte from I2C_DATA*/
            *p_i2c->rxbuffer.buffer++ = i2c_data_receive(p_i2c->periph);
            p_i2c->rxbuffer.pos++;
            if(0 == data_length - p_i2c->rxbuffer.pos){
                /* send a stop condition */
                i2c_stop_on_bus(p_i2c->periph);
                i2c_ack_config(p_i2c->periph, I2C_ACK_ENABLE);
                i2c_ackpos_config(p_i2c->periph, I2C_ACKPOS_CURRENT);
                /* disable the I2C interrupt */
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_BUF);
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);
                i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
                if(NULL != p_func){
                    p_func(p_i2c);
                }
            }
        }
    }else if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_TBE)){
            if(I2C_MEMORY_ADDRESS_8BIT == p_i2c->slave_address.address_size){
                i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_LSB(p_i2c->slave_address.memory_address));
                p_i2c->slave_address.second_addressing = SET;
            }else{
                if(0 == p_i2c->slave_address.address_count){
                    i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_MSB(p_i2c->slave_address.memory_address));
                    p_i2c->slave_address.address_count++;
                }else{
                    i2c_data_transmit(p_i2c->periph, I2C_MEMORY_ADDRESS_LSB(p_i2c->slave_address.memory_address));
                }
            }
            /* wait until BTC bit is set */
            while(!i2c_flag_get(p_i2c->periph, I2C_FLAG_BTC));
            /* send a start condition to I2C bus */
            i2c_start_on_bus(p_i2c->periph);
    }
}

/*!
    \brief      event handler for address listen in slave mode
    \param[in]  i2c: I2C device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2c_address_listen_interrupt(void *i2c)
{
    hal_i2c_dev_struct *p_i2c = i2c;
    hal_i2c_user_cb p_func = (hal_i2c_user_cb)p_i2c->rx_callback;
    
    i2c_interrupt_disable(p_i2c->periph, I2C_INT_ERR);
    i2c_interrupt_disable(p_i2c->periph, I2C_INT_EV);

//    if(i2c_interrupt_flag_get(p_i2c->periph, I2C_INT_FLAG_ADDSEND)){
//        i2c_interrupt_flag_clear(p_i2c->periph, I2C_INT_FLAG_ADDSEND);
        /* check transfer direction in p_func, so that the user knows 
        which function to call next(hal_i2c_slave_serial_transmit_interrupt
        or hal_i2c_slave_serial_receive_interrupt) */
        if(NULL != p_func){
            p_func(p_i2c);
        }
//    }
}
